Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob/facta/skuvlahistorja2/asta-s.htm.tmx
Source language: sme
Languages: nob

source: På norsk
nob: Sámegillii

source: Artihkal girjjis Sámi skuvlahistorjá 2.
nob: Artikkel i boka Samisk skolehistorie 2.

source: – Mu lojalitehta lei sámi servodagas
nob: – Min lojalitet var hos det samiske samfunnet

source: Čállon ovttasráđiid Svein Lundiin
nob: Skrevet i samarbeid med og oversatt av Svein Lund

source: Asta Balto, Guovdageaidnu 2005 (Govva: Svein Lund)
nob: Asta Balto (Foto: Svein Lund)

source: Asta Mitkijá Balto (Mienna-Márjjá Máret Asta) lea leamaš guovddážis sámi skuvlla ovdánahttimis maŋimuš moaddelogi jagi.
nob: Asta Mitkijá Balto (Mienna-Márjjá Máret Asta) har vært en sentral person i utviklinga av samisk opplæring de siste par tiåra.

source: Son riegádii 1948:s ja šattai bajás Fárpenjárggas, Kárášjogas, 16 km márkanis eret.
nob: Hun er født i 1948 og vokste opp på Fárpenjárga i Karasjok, 16 km fra kirkestedet.

source: Meahccemánat fertejedje dorvvastit internáhttii skuvlla vázzedettiin.
nob: Den gang måtte utkantbarna bo på internat under skolegangen.

source: 18-jahkásažžan álggii Romssa oahpaheaddjiskuvlii ja dan maŋŋá barggai vuođđoskuvlaoahpaheaddjin Porsáŋggus ja Álttás.
nob: 18 år gammel begynte Asta Balto på lærerskole i Tromsø, og deretter arbeida hun som grunnskolelærer i Porsanger og i Alta.

source: Sus lea sámegiela vuođđofága Álttás, suomagiela vuođđofága Lappeenrantas ja sosialpedagogihka váldofága Oslo universitehtas.
nob: Hun har samisk grunnfag fra Alta, finsk grunnfag fra Lappeenranta og sosialpedagogikk hovedfag fra Universitetet i Oslo.

source: Iežas váldofágabarggu vuođul son lea almmuhan girjji Sámi mánáidbajásgeassin nuppástuvvá.
nob: På grunnlag av sitt eget hovedfagsarbeid har hun seinere utgitt boka Samisk barneoppdragelse i endring.

source: Asta Balto lea bargan allaskuvlaoahpaheaddjin Álttás, Sámi Instituhta dutkin ja Sámi oahpahusráđi direktoran.
nob: Asta Balto har arbeida som høgskolelærer i Alta, som forsker ved Nordisk Samisk Institutt og som direktør ved Samisk utdanningsråd.

source: 1994 ' rájes lea oahpahan Sámi allaskuvllas, gos 1996–2000 lei válljejuvvon rektorin.
nob: Fra 1994 har hun undervist og forska ved Samisk høgskole, der hun i perioden 1996-2000 var valgt som rektor.

source: Sus leat leamaš máŋga doaimma sámi ja norgga oahpahusa ja dutkama oktavuođas, ee. SUFUR ' stivrras [SUFUR = Samordningsutvalget for Finnmark utdanningsregion (Finnmárkku oahpahusregiuvnna ovttastahttinlávdegoddi).
nob: Hun har hatt mange verv innafor samisk og norsk utdanning og forskning, bl.a. medlem av styret i SUFUR, [SUFUR = Samordningsutvalget for Finnmark utdanningsregion.

source: Finnmárku lei sierra oahpahusregiuvdna áigodagas 1988-99.], Oahpaheaddjioahpahusráđis ja Našuvnnalaš dutkanetihkka lávdegottis.
nob: Finnmark var egen utdanningsregion i tida 1988-99.] i Lærerutdanningsrådet og i Nasjonalt forskningsetisk utvalg.

source: Son lea viššalit bargan internášunaliseret sámi oahppovuogádaga ja čatnan oktavuođaid eará álgoálbmogiiguin ja unnitloguálbmogiiguin.
nob: Hun har arbeida ivrig for internasjonalisering av det samiske utdanningssystemet og knytta kontakt med andre urfolk og minoriteter.

source: Son lea čállán artihkkaliid sámi skuvlaáššiid birra ja redigeren girjji: Diehtu ja gelbbolašvuohta Sámis..
nob: Asta Balto har skrevet diverse artikler om samiske skolespørsmål og redigert boka Kunnskap og kompetanse i Sápmi.

source: Dárogiella «god dag» - dásis
nob: Norsk på «god dag» - nivå

source: – Ruovttus hálaimet aivve fal sámegiela, muhto skuvllas galggai visot leat dárogillii.
nob: – Hjemme snakka vi bare samisk, men på skolen skulle alt være på norsk.

source: Mu vuosttaš oahpaheaddji lei Anna Mørk.
nob: Den første læreren min var Anna Mørk.

source: Son lei guhká oahpaheaddjin Kárášjogas, lea skuvlen mu eatni maid.
nob: Hun var lenge lærer i Karasjok, hun hadde også undervist mor mi.

source: Son lei rivgu, muhto máhtii sámegiela.
nob: Hun var norsk, men kunne samisk.

source: Muittán vuosttas skuvllabeaivvi go son jearai geat dárogiela máhtte.
nob: Jeg husker første skoledagen, da hun spurte hvem som kunne norsk.

source: Mun geigejin gieđa, máhtten han mun cealkit «god dag !».
nob: Jeg rakte opp handa, for jeg kunne jo si «God dag !».

source: Iežan oarpmeali, gii čohkkái mu bálddas, vehkehin maid geiget gieđa go son máhtii seamma ollu go mun.
nob: Så hjalp jeg også kusina mi, som satt ved sida av meg, til å rekke opp handa si, for jeg visste at hun kunne like mye som meg.

source: Muhto duohtavuohta lei ahte ean máhttán olus eanet go oktageardánis «god dag».
nob: Sannheten var at ingen av oss kunne stort mer enn dette «god dag».

source: Anna Mørk oahpahii eanaš dárogillii, muhto čilgii midjiide sámegillii go eat ádden.
nob: Anna Mørk underviste mest på norsk, men forklarte oss på samisk når vi ikke forsto.

source: Danin šattai álkit midjiide gulahallat álgoskuvlajagiid, ja go maŋŋá oaččuimet eará oahpaheddjiid, geat eai máhttán sámegiela, de leimmet juo eanet áddegoahtán dárogiela.
nob: Derfor blei det lettere for oss å forstå de første skoleåra, og seinere, da vi fikk andre lærere, som ikke kunne samisk, da hadde vi jo allerede begynt å forstå norsk.

source: Go galggaimet álo dárostit diimmuin, de skuvla ii ovdánahttán min eatnigielmáhtu.
nob: Siden vi alltid skulle snakke norsk i timene, så utvikla ikke skolen morsmålsferdighetene våre.

source: Baicce lei nu ahte giella hedjonii internáhtas, go eat gullan eará go seammaahkásaš mánáid sámegiela. Giella bissánii máná dássái.
nob: Snarere var det slik at språket blei dårligere på internatet, fordi vi ikke hørte annen samisk enn den våre jevnaldrende snakka, språkutviklinga stoppa på barnestadiet.

source: Mu ruovttubirrasis lei nana sámegiella ja go mii mánát bođiimet ruoktot de mu váhnen-guovttus vávjjiiga min giela.
nob: I hjemmemiljøet mitt sto samisk språk sterkt og når vi kom hjem, så retta foreldrene mine på språket vårt.

source: Muittán sudno rávvagiid, váibbakeahttá fuomášahtiiga; «sámegielas mii eat loga nie, mii lohkat ná».
nob: Jeg husker ennå rådene deres, utrøttelig viste de til at «på samisk snakker vi ikke slik, men slik».

source: Skuvlastreaika
nob: Skolestreik

source: Olles 9 jagi vuođđoskuvllas fertejin orrut internáhtas.
nob: Hele 9 års grunnskole måtte jeg bo på internatet.

source: Álggos Kárášjoga skuvlainternáhtas, márkanis.
nob: Først på Karasjok skoleinternat, på kirkestedet.

source: Dalle beasaimet ruoktot juohke lávvardaga, ja vaikko gárttaimet vázzit go busse vujii dušše beallemuddui, de lei álo somá vuolgit ruovttus finadit ovtta ija.
nob: Da kom vi hjem hver lørdag, og sjøl om vi måtte gå langt fordi bussen kjørte bare halvveis, var det alltid godt å være hjemme ei natt.

source: Go vázzen 3. luohká, de mearriduvvui ahte meahccemánát galget biddjot Rájá skuvlii, mii lei márkanis nuppe guvlui guokte miilla.
nob: Da jeg gikk i 3. klasse blei det bestemt at utkantbarna skulle sendes til Grensen skole, som var to mil i motsatt retning fra kirkestedet.

source: Dat dagahii ahte mátki ruoktot šattai nuppe dan mađe, ja mii eat beassan ruoktot go oktii mánus, jus dange.
nob: Det gjorde at reisa hjem blei mer enn dobbelt så lang, og vi kom hjem bare en gang i måneden, og knapt nok det.

source: Áhčči lei mielde gielddastivrras ja vikkai politihkalaččat vuostálastit, muhto ii lihkostuvvan.
nob: Far var med i kommunestyret og forsøkte å motarbeide dette politisk, men lyktes ikke og gikk så sammen med noen andre foreldre til skolestreik.

source: Muhtin eará váhnemiiguin lágidedje dalle skuvlastreaikka, vedde mánáid ruovttus golbma vahku.
nob: De holdt barna hjemme tre uker.

source: Muhto buot váhnemat eai searvan streikii.
nob: Men det var ikke alle foreldrene som deltok i streiken.

source: Birgejupmi ii lean ráhpat ja muhtimat rehkenaste ahte seste jáffoseahka go mánát eai boahtán ruoktot nu dávjá.
nob: Folk hadde dårlig råd og noen regna ut at de sparte en mjølsekk på at barna ikke kom hjem så ofte.

source: Rájá internáhtas oruimet guhtta nieidda ovtta lanjas.
nob: På Grensen internat bodde vi 6 jenter på et rom.

source: Muittán vuosttaš skuvlabeaivvi go oappáin gurriime bivttasbumbbáid maid áhčči lei dahkan, ja barddiime buot čábbát skábii.
nob: Jeg husker første skoledagen da jeg og søster mi tømte kleskista som far hadde laga og stabla alt fint inn i skapet.

source: Muhto dan botta go leimmet olgun de ledje munno ođđa latnjaskihpárat bálkon munno diŋggaid hiluid háluid miehtá lanja.
nob: Mens vi var ute hadde våre nye romkamerater kasta tinga våre hulter til bulter rundt i rommet.

source: Lea vissásit dat vearrámus buorásteapmi maid goassege leaččan vásihan.
nob: Det er sikkert den verste velkomst jeg noen gang har opplevd.

source: Mánát ledje dávjá iehčanassii ja bállejedje olgguštit go rávesolbmot eai lean lahkosis.
nob: Barna var ofte for seg sjøl og fikk fred til å utstøte andre når det ikke var noen voksne i nærheten.

source: Mun ledjen earalágán mánná, go earát stohke, de mun lohken girjjiid.
nob: Når andre leika, leste jeg bøker, jeg leste alt som var i skolebiblioteket.

source: Dalle jo go áddegohten dárogiela, de mus loktanii mokta lohkat, lohken buotlágán girjjiid.
nob: Helt fra jeg begynte å forstå norsk, så interesserte jeg meg for å lese, jeg leste all slags litteratur.

source: Čeahpes oahpaheaddjit
nob: Flinke lærere

source: Rájá skuvllas vázzen golbma jagi ja ledjen duhtavaš oahpaheddjiiguin; Trygve Madsen ja su eamit Randi [Geahča jearahallama Trygve ja Randi N. Madseniin], Inger Johanne Kåven ja Rolf Presthus.
nob: På Grensen skole gikk jeg i 3 år og jeg var fornøyd med lærerne; Trygve Madsen og kona hans, Randi [Se intervju med Trygve og Randi N. Madsen], Inger Johanne Kåven og Rolf Presthus.

source: Erenoamážit muittán Randi Nordback Madsena, geas ohppen hui ollu.
nob: Særlig husker jeg Randi Nordback Madsen, som jeg lærte svært mye av.

source: Son lei mu oahpaheaddji sihke 6. luohkás Rájá skuvllas ja maŋŋil nuoraidskuvllas, maid vácciimet Kárášjoga márkanis.
nob: Hun var læreren min både i 6. klasse på Grensen skole og seinere på ungdomsskolen, som vi gikk på kirkestedet.

source: 7. luohkás mis lei Inez Boon oahpaheaddjin.
nob: I 7. klasse var Inez Boon lærer, hun var en flink lærer.

source: In dalle diehtán man dehálaš rolla sus lei sámegiel álgooahpahusa álggaheamis [Geahča Inez Boona iežas muitalusa, Sámi skuvlahistorjjá 1. girjjis.]
nob: Den gang visste jeg ikke hvilken viktig rolle hun hadde i oppstarten av samisk begynneropplæring. [Se Inez Boons egen fortelling i Samisk skolehistorie bind 1.]

source: Deiven su fas studeredettiin Oslos, dalle son barggai Universitehtalágádusas.
nob: Jeg traff henne igjen da jeg studerte i Oslo, da arbeida hun i Universitetsforlaget.

source: Obbalohkái ledje mis čeahpes ja allaoahppan oahpaheaddjit nuoraidskuvllas.
nob: I det hele tatt hadde vi flinke og høyt utdanna lærere på ungdomsskolen.

source: Daid gaskkas lei Inger Sophie Bolstad, gii lei báhpa eamit.
nob: Blant dem var Inger Sophie Bolstad, som var gift med presten.

source: Su isit Jo Bolstad lei erenoamážit nuoraid báhppa, son huksii nuoraide hui buori ja positiiva loaktinbirrasa.
nob: Mannen hennes, Jo Bolstad, var særlig ungdommens prest, han bygde opp et godt og positivt miljø for ungdommen.

source: Ee. ráhkadii minguin teahterbihtá man čájeheimmet álbmotallaskuvllas, gosa ollu olbmot ledje boahtán geahččat.
nob: Bl.a. laga han et teaterstykke med oss, som blei vist på folkehøgskolen og mange var kommet for å se det.

source: Mu váhnemat maid leigga geahččamin ja áhkku, vaikko lei leastadiálaš, iige riekta liikon teáhterii.
nob: Foreldra mine var også der, og bestemor, sjøl om hun var læstadianer og ikke riktig likte teater.

source: Liikká manai bures gitta dassážii go muhtin nuorra iđistii lávddi ala neavttašit Jesusa, de gal áhkku njuikii beaŋkkas ja jávkkihii olggos, iige boahtán šat sisa.
nob: Likevel gikk det bra helt til en ungdom kom opp på scenen og spilte Jesus, da hoppa bestemor opp fra benken og forsvant ut, og kom ikke inn igjen.

source: Vuosttaš jagit mánáidskuvllas manne oahppat dárogiela.
nob: De første åra på barneskolen gikk med til å lære norsk.

source: Rahčen ollu dáinna, ja in oahppan nu ollu eará fágain.
nob: Jeg strevde mye med det, og lærte ikke så mye i de andre faga.

source: Dávjá bohten ruoktot heajumus árvosániiguin; «Lite godt» matematihkas, historjjás, luonddufágas jna..
nob: Ofte kom jeg hjem med dårligste karakter; «Lite godt» i matematikk, historie, naturfag osv..

source: Easka go 5.–6. luohkáin ledjen oahppan oalle bures dárogiela, de buorránišgohte árvosánit.
nob: Først da jeg i 5.–6. klasse hadde lært ganske bra norsk, begynte karakterene å bli bedre.

source: Munnje lei maid ávkin go 8. luohkás ožžon buori skuvllaoappá, gii bođii Kongsbergas.
nob: For meg var det også nyttig da jeg i 8. klasse fikk en god klassekamerat, som kom fra Kongsberg.

source: Su áhčči bođii kapteaidnan Porsangmoenii ja go oahpaheaddjit maid hálle máttasuopmana, de mun ohppen sin áddestaladettiin máttanorgga suopmana hállat.
nob: Far hennes kom som kaptein til Porsangmoen og da lærerne også snakka sørnorsk, så lærte jeg å snakke sørnorsk dialekt ved å herme etter dem.

source: Go gergen nuoraidskuvllas, de ožžon buot buoremus árvosáni dárogielas; «Sg».
nob: Da jeg gikk ut av ungdomsskolen fikk jeg beste karakter i norsk; «Særdeles godt».

source: Birgejin vel buorebut go máŋga eará, geat ledje dárolaččat !
nob: Jeg klarte meg enda bedre enn mange andre som var norske !

source: Lei somá fuobmát ahte in lean duššás rahčan.
nob: Det var artig å se at jeg ikke hadde streva forgjeves.

source: Go mun válljejin teoriijalinjá 8. luohkás ja buot mu skuvllaoappát ja - vieljat válljejedje praktihkalaš linjá, de šadden hui okto leat internáhtas.
nob: Da jeg valgte teorilinja i 8. klasse og alle mine klassekamerater valgte praktisk linje, så blei jeg aleine på internatet.

source: Mu ođđa luohkkálaččat eai orron internáhtas, muhto priváhta ásodagain márkanis.
nob: Mine nye klassekamerater bodde ikke på internatet, men i private leiligheter på kirkestedet.

source: Sii bohte eará guovlluin nugo Guovdageainnus ja Porsáŋggus.
nob: De kom fra andre områder som Kautokeino og Porsanger.

source: Nuoraidskuvlla internáhta eallin ii lean nu váigat, ledjen hárjánan dasa ja ieš maid rávásmuvvan.
nob: Livet på ungdomsskoleinternatet var ikke så ille, jeg var vant til det og hadde også blitt mer voksen.

source: Áidna mii ii lean nu buorre lei go galggaimet nu árrat sisa eahkediid, diibmu ovccis ja go ledje ollu bihtát, de in báljo geargan šat iehčan luohkálaččaiguin ovttastallat.
nob: Det eneste som ikke var bra var at vi skulle være inne så tidlig om kveldene, klokka ni, og når vi hadde mye lekser, fikk jeg knapt tid å være sammen med klassekameratene.

source: Mu áhčči háliidii ahte galgen loaktit skuvllas ja bivddii mu ovddas lobi leat guhkit olgun go earát internáhtas nu ahte bessen doallat oktavuođa mu luohkkálaččaiguin.
nob: Far min ville at jeg skulle trives på skolen, og ba for meg om at jeg kunne få være lengre ute enn andre fra internatet, slik at jeg kunne ha kontakt med klassekameratene.

source: Lei hui erenoamáš dáhpáhus go rektor juolludii munnje dan lobi.
nob: Det var ei veldig spesiell hending da rektor ga meg tillatelse til det.

source: Dovden stuorra luohttámuša alccesan ja lohpidin áhččái ahte in áiggo rihkkut makkárge njuolggadusaid !
nob: Jeg kjente det som ei stor tillitserklæring, og lova far at jeg ikke skulle bryte noen regler !

source: Diet lei munnje vuosttaš oahppu das mo mánnái váikkuha go oažžu luohttámuša ja ovddasvástádusa, su iešluohttámuš nanusmuvvá.
nob: Det var for meg den første lærdommen om hvordan det virker på barn når de får tillit og ansvar; da vokser sjøltilliten.

source: Internáhta dálueamidii lei bahča dohkkehit ahte munnje juolluduvvui sierra ortnet, vikkai árvvohuššat muinna, muhto in beroštan, áhčči ja rektor leigga mearridan !
nob: Husmora på internatet hadde tungt for å svelge at jeg blei innvilga ei særordning, hun forsøkte å argumentere med meg, men det brydde jeg meg ikke om. Far og rektor hadde bestemt !

source: Dáhpáhusa in vajálduhte goassege ja leage báidnán mu pedagogalaš jurddašeami ja beroštumi gitta dássážii.
nob: Den hendinga glømmer jeg aldri og det har forma mi pedagogiske tenking helt til i dag.

source: Nuoraidskuvllas lei eaktodáhtolaš 10. jahki, man mun vázzen.
nob: På ungdomsskolen var det frivillig 10. år, som jeg gikk.

source: Bessen dalle oahppat duiskkagiela, ja Einar Gullichsen lei oahpaheaddjin.
nob: Da fikk jeg lære tysk, med Einar Gullichsen som lærer.

source: Son lei dat gii eanemusat mu movttidahtii ohcat oahpaheaddjiskuvlii.
nob: Han var den som mest motiverte meg til å søke meg til lærerskolen.

source: Girjás mánnávuođa ruoktu
nob: Allsidig barndomshjem

source: Kárášjogas lei dan áiggi garra digaštallan ja nággu oahpahusgiela hárrái.
nob: I Karasjok var det i den tida hard diskusjon og strid om undervisningsspråket.

source: Máŋggas oaivvildedje ahte sámegielas ii lean boahtteáigi ja muhtin sámegiel váhnemat dárustišgohte mánáidasaset.
nob: Mange mente at samisk språk ikke hadde noen framtid og noen samiskspråklige foreldre begynte å snakke norsk til barna sine.

source: Áhččán ja eadnán sámásteigga ruovttus minguin, muhto dattetge eaba háliidan ahte mis galggai leat sámegiella skuvllas.
nob: Far min og mor mi snakka samisk med oss hjemme, men likevel ønska de ikke at vi skulle ha samisk på skolen.

source: Sudnuide ledje jáhkihan ahte mánát eai dalle oahpašii dárogiela, eaige birgešii stuoraservodagas.
nob: De hadde fått den trua at barna da ikke ville lære norsk og ikke klare seg i storsamfunnet.

source: Áhčči lei okta dain gii searvvai vuolláičállit cealkámuša vuostálastin dihtii Sámelávdegotti árvalusa.
nob: Far var en av dem som skreiv under på motstand mot forslaga fra Samekomiteen.

source: Son lei doaimmalaš Bargiidbellodaga miellahttu ja bellodaga propagánda ja vuđolaš jáhkku lei ahte ođđa áigái ovdánahttin dáhpáhuvai dušše fal dárogiela bokte.
nob: Han var aktivt medlem av Arbeiderpartiet og partiets propaganda og grunnsyn var at i den nye tida foregikk utvikling bare gjennom norsk språk.

source: Mu vánhen-guoktái ferte dát leat leamašan dileamma, go ruovttus čuovuiga min sámegielovdáneami dárkilit ja rávviiga min hállat sámegiela riekta ja čielgasit.
nob: For foreldrene mine må det ha vært et dilemma, for hjemme fulgte de nøye med på den samiske språkutviklinga vår og råda oss til å snakke samisk reint og klart.

source: Manne máŋgalot jagi ovdalgo soai álggiiga oaidnit ahte sámi gielas ja kulturárbbis lea sierra sadji, ii dušše priváhta dásis, muhto maiddái almmolašvuođas, riektevuogádagas ja skuvlavuogádagas.
nob: Det gikk mange år før de begynte å innse at samisk språk og kulturarv hadde sin plass, ikke bare på det private plan, men også i offentligheten, rettsvesenet og skolesystemet.

source: Vaikko min áhčči lei leastadiálaš sárdnealmmái, de lei son maid sosialista ja min ruovttus lei lohpi sihke juoigat, lávlut sálmmaid ja lávlagiid nugo Internašunála.
nob: Sjøl om far vår var læstadiansk predikant, så var han også sosialist, og i hjemmet vårt var det lov å både joike, synge salmer og sanger som Internasjonalen.

source: Áhčči lei luohtečeahppi ja ráhkadii luđiid midjiide mánáide, vaikko leastadiálaččat ja girku gilde juoigama ja atne dan suddun.
nob: Far var en flink joiker og laga joiker til oss barna, sjøl om læstadianerne og kirka forbød joiken og så på den som synd.

source: Min eadni fas lávii dánsestallat ja oahpaimet dánsut suinna gievkkanláhttis.
nob: Mor vår brukte å danse og lærte oss å danse med henne på kjøkkengolvet.

source: Ii datge lean dábálaš dalá ruovttuin.
nob: Det var heller ikke helt vanlig i hjemmene på den tida.

source: Ruoktu ii lean dušše oainnuid dáfus máŋggabealat, go dohko čoahkkanedje ja doppe deaivvadedje máŋggalágan olbmot.
nob: Hjemmet var ikke bare mangfoldig i meninger, men her var også et mangfoldig møte med mennesker.

source: Mii leimmet smávvadálolaččat ja lassin dálu omiide ledje mis alddámet bohccot, geahččobohccot.
nob: Vi var småbrukere og i tillegg til husdyra hadde vi egne rein, sytingsrein.

source: Min ruovttus joreštedje buotlágán olbmot, riggát ja geafit, badjeolbmot ja dálonat, fuolkkit ja vierrásat, báikki- ja vierrobáikkiid olbmot, oarjjabealsámeverddet mat bohte Guovdageainnus, sárdnealbmát, báhpat, politihkkárat, turisttat ja eará mátkkošteaddjit.
nob: Alle slags folk kom innom i hjemmet vårt; rike og fattige, flyttsamer og fastboende, slektninger og fremmede, lokalbefolkning og tilreisende, samiske venner som kom fra Kautokeino, predikanter, prester, politikere, turister og andre reisende.

source: Maŋŋil lean oaidnán min mánnávuođa rabas ruovttubirrasa stuorra riggodahkan.
nob: Seinere har jeg sett på min barndoms åpne hjemmemiljø som en stor rikdom.

source: Mu vánhemiid olmmošoainnu báinnii dieđusge sudno risttalašvuohta mii lei eanet ráhkislaš go dubmejeaddji, ja soaitá ahte sudno olmmošlaš rabasvuohta nannejuvvui go soađiáiggi šattaiga báhtarit Ruŧŧii.
nob: Mine foreldres menneskesyn påvirka sjølsagt deres kristendom, som var mer kjærlig enn dømmende, og kanskje blei deres menneskelige åpenhet styrka da de under krigen var flyktninger i Sverige.

source: Rabasvuohta earáide ii njeaidán sudno gullevašvuođa Sápmái, leigga nannosat sámevuođaineaskka.
nob: Åpenhet for andre svekka ikke deres tilhørighet til Sápmi, de var sterke i sin samiskhet.

source: Áhčči-guovttos dáguheigga ahte buot olbmuin lea seammá árvu ja lean dán rávvaga bisuhan váimmustan.
nob: De understreka at alle mennesker har samme verdi og det har jeg bevart i mitt hjerte.

source: Ollesolmmožin lean giitevaš go mu ruoktobiras lea munnje hábmen olmmošoainnu mii ovttastahttá buot olbmuid ja lea leamašan ávkkálaš sihke persovnnalaččat ja virggálaččat diehtit ahte ii olmmoš dárbbaš leat jogo – dahje sáhttá leat sihke – ja máŋgga dáfus eallimis ja liikká leat oadjebas iežainis.
nob: Som voksen er jeg takknemlig for at hjemmemiljøet har forma et menneskesyn som likestiller alle mennesker og det har vært nyttig både personlig og i arbeidet mitt å vite at et menneske trenger ikke være enten – eller det kan være både – og på mange måter i livet og likevel være trygg på seg sjøl.

source: Máŋggat jagit golle, vánhen-guovttos leigga juo hárjánan ahte sámegiella galggai gullot skuvllas maid ja leigga midjiide mánáide stuorra doarjjan dákko bokte.
nob: Mange år gikk, foreldrene mine hadde allerede vent seg til at samisk skulle høres også på skolen og de var en stor støtte for oss barna i det.

source: Min bearaš lei bisuhan sámegoarggu, eaba lean miehtan lonuhit Baltto nama muhtin dáža namman nugo omd. váldit namman min báikki nama mii lei virggálaččat Randberg.
nob: Familien min hadde beholdt det samiske etternavnet, de hadde ikke bytta bort Balto-navnet med et norsk navn, f.eks. tatt navnet på gården, som offisielt var Randberg.

source: (Sámenamma gal lei Fárpenjárga.)
nob: (Det samiske navnet var Fárpenjárga.)

source: Ollugat Kárášjogas lonuhedje goargguid eanalága mielde, mii lei fámus 1902 ' rájes.
nob: Mange i Karasjok bytta ut etternavna etter jordloven, som var i kraft fra 1902.

source: Ođđa hástalus oaivillonohallama dáfus čuožžilii Álttá-Guovdageainnu eanu dulvadeami oktavuođas.
nob: Ei ny utfordring for meningsutvekslinga oppsto i sammenheng med utbygginga av Alta-Kautokeino-vassdraget.

source: Eanaš boarrásat olbmot balle dáža eiseválddiin, sii balle soađis, ráfehisvuođas man ieža ledje vásihan.
nob: De fleste eldre var redde for de norske myndighetene, de var redde for krig og ufred som de sjøl hadde opplevd.

source: Muhtimat mis mánáin serve miellačájehemiide Álttá dulvadeami vuostá.
nob: Noen av oss deltok i demonstrasjonene mot Alta-utbygginga.
